public_html/cc_tool.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>cc-tool</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">cc-tool</h1>
<p>
Para la instalación de cc-tool en Linux Mint hay que instalar las dependencias, clonar el repositorio y compilarlo para nuestra máquina. Arrancamos con los siguientes comandos:
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo apt-get update
sudo apt-get install git build-essential libusb-1.0-0-dev
sudo apt-get install automake autoconf libtool
git clone https://github.com/dashesy/cc-tool.git
<span style="color: #e5786d;">cd</span> cc-tool
</pre>
</div>

<p>
El siguiente paso es configurar la compilación
</p>
<div class="org-src-container">
<pre class="src src-bash">./configure
</pre>
</div>

<p>
Durante el configure obtengo un error que indica que no dispongo de la versión de Boost igual o superior a 1.74:
</p>
<div class="org-src-container">
<pre class="src src-bash">configure: error: cannot find Boost headers version &gt;= 1.74.0
</pre>
</div>

<p>
Instalamos la versión requerida de Boost: (1.74)
</p>

<p>
Mediante apt se instala la versión 1.71 por lo que hay que descargarla de la web y compilarla para nuestra máquina mediante las siguientes instrucciones.
</p>
<pre class="example">
wget https://boostorg.jfrog.io/artifactory/main/release/1.74.0/source/boost_1_74_0.tar.gz
tar -xzf boost_1_74_0.tar.gz
cd boost_1_74_0
./bootstrap.sh
sudo ./b2 install
</pre>

<p>
Con Boost ya instalado, intento de nuevo la configuración de la compilación
</p>
<div class="org-src-container">
<pre class="src src-bash">./configure
</pre>
</div>

<p>
Ahora, al hacer el "Configure" obtengo el error:
</p>
<div class="org-src-container">
<pre class="src src-bash">configure: error: the libext variable is empty, did you invoke Libtool?
</pre>
</div>

<p>
Parece que no tengo instalado "Libtool" o instalado incorrectamente por lo que lo reinstalo.
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo apt-get install --reinstall libtool
</pre>
</div>

<p>
Volvemos a regenerar el archivo configure:
</p>
<div class="org-src-container">
<pre class="src src-bash">./configure
</pre>
</div>

<p>
Al fin lo pasa sin error pero ahora al hacer el "make" obtengo este error:
</p>
<div class="org-src-container">
<pre class="src src-bash">configure.ac:8: error: required file <span style="color: #95e454;">'./compile'</span> not found
</pre>
</div>

<p>
Para corregir este error hay que regenerar los archivos de Autotools y realizar la compilación:
</p>
<div class="org-src-container">
<pre class="src src-bash">autoreconf --install
make
sudo make install
cc-tool --version
</pre>
</div>

<p>
Al comprobar la versión instalada de cc-tool obtengo este error:
</p>
<div class="org-src-container">
<pre class="src src-bash">cc-tool: error while loading shared libraries: libboost_filesystem.so.1.74.0: cannot open shared object file: No such file or directory
</pre>
</div>

<p>
Para corregirlo hay que actualizar las rutas de bibliotecas compartidas:
</p>
<blockquote>
<p>
El comando ldconfig se usa para actualizar la caché de las bibliotecas dinámicas del sistema, lo cual es necesario si has instalado bibliotecas manualmente o si has agregado nuevas rutas de búsqueda de bibliotecas. Esta solución debería permitir que cc-tool encuentre la biblioteca libboost<sub>filesystem.so.1.74.0</sub> y se ejecute correctamente.
</p>
</blockquote>

<p>
Al instalar manualmente Boost hay que agregar el directorio de las bibliotecas de Boost (generalmente /usr/local/lib si instalaste desde la fuente) a las rutas de búsqueda y actualizar la actualiza la caché de las bibliotecas dinámicas:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #e5786d;">echo</span> <span style="color: #95e454;">"/usr/local/lib"</span> | sudo tee -a /etc/ld.so.conf.d/boost.conf
sudo ldconfig
</pre>
</div>

<p>
Con sólo estos pasos podemos decir que ya tenemos instalado cc-tool.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-09-11</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
